{
  "title": "Урок 3: Цикли в C#",
  "lesson-secondtitle": "Какво означава да програмираме?",
  "text": "Циклите в C# позволяват многократно изпълнение на код. Основните са for, while, do-while и foreach.\n Конструкция за цикъл while Един от най-простите и най-често използвани цикли е while. \n\nwhile (условие) \n{ \nтяло на цикъла; \n} \n\nВ кода по-горе условие представлява произволен израз, който връща булев резултат – истина (true) или лъжа (false). Той определя докога ще се изпълнява тялото на цикъла и се нарича условие на цикъла (loop condition). В примера тяло на цикъла е програмният код, изпълняван при всяко повторение (итерация) на цикъла, т.е. всеки път, когато входното условие е истина. Логически поведението на while циклите може да се опише чрез следната схема:",
  "image": "public/images/diagram3.png",
  "lesson-thirdtitle": "Конструкция за цикъл do-while",
  "text3": "Do-while цикълът е аналогичен на while цикъла, само че при него проверката на булевото условие се извършва след изпълнението на операциите в цикъла. Този тип цикли се наричат цикли с условие в края (post-test loop). Един do-while цикъл изглежда по следния начин: \n\ndo \n{ \nкод за изпълнение; \n} \nwhile (израз); \n\nСхематично do-while циклите се изпълняват по следната логическа схема:",
  "image3": "public/images/diagram3-2.png",
  "fourthtitle": "Конструкция за цикъл for",
  "text4": "For-циклите са малко по-сложни от while и do-while циклите, но за сметка на това могат да решават по-сложни задачи с по-малко код. Ето как изглежда логическата схема, по която се изпълняват for-циклите: Те съдържат инициализационен блок (A), условие на цикъла (B), тяло на цикъла (D) и команди за обновяване на водещите променливи (C). нека разгледаме как изглежда програмният код на един for-цикъл: \n\nfor (инициализация; условие; обновяване) \n{ \nтяло на цикъла; \n}",
  "image4": "public/images/diagram3-3.png",
  "fifthtitle": "Цикълът foreach (разширен for-цикъл)",
  "text5": "Цикълът foreach (разширен for-цикъл) е нов за C/C++/C# фамилията от езици, но е добре познат на VB и PHP програмистите. Тази конструкция служи за обхождане на всички елементи на даден масив, списък или друга колекция от елементи. Подробно с масивите ще се запознаем в темата Масиви, но за момента можем да си представяме един масив като наредена последователност от числа или други елементи. Ето как изглежда един foreach цикъл: \n\nforeach (variable in collection) \n{ \nstatements; \n}",
  "image5": "public/images/diagram3-4.png",
  "audio": "public/audio/lesson3.mp3"
}